feat: added plantuml previewer removed uneeded features
